
# 프로그래머스 스타일 로 ...
def solution(N, inp):
    answer = 0

    # 만약 A라는 지원자보다 키도 크고 몸무게도 무거운 지원자가 존재한다면 A지원자는 탈락
    f_num = 0
    for i in range(len(inp)):
        for j in range(len(inp)):

            if i == j :
                continue
            #print(i, j)

            if ((inp[i][0] < inp[j][0]) and
                 (inp[i][1] < inp[j][1] ) ):
                f_num += 1
                print('f: ', inp[i] , '<-', inp[j])
                break

    answer = N - f_num
    return answer

N = 5

inp = [(172, 67), (183, 65), (180, 70), (170, 72), (181, 60)]

re = solution(N, inp)
print('re :', re)
#=> 3
print('==============================')

N = 10

inp = [ (177, 107), (205, 88 ), (179, 65 ), (165, 104), (180, 50 ), (166, 116), (199, 119), (171, 70 ), (176, 51 ), (207, 101)]

re = solution(N, inp)
print('re :', re)
#=> 2
print('==============================')

N = 15

inp = [ (192, 117), (190, 110), (184, 98 ), (212, 91 ), (177, 89 ), (218, 78 ), (152, 106), (182, 64 ), (193, 88 ), (198, 71 ), (216, 111), (155, 101), (181, 92 ), (173, 77 ), (215, 97 )]

re = solution(N, inp)
print('re :', re)
#=> 3
print('==============================')