
# 연습용

def is_free(ix, iy):
    for i in range(iy):
        if x[i] == ix or abs(x[i] - ix) == abs(i - iy):
            return False
    return True

def dfs(n):
    global result, x
    # 참고용 -->
    for i in range(n):
        print(' ', end=' ')
    # //<--

    print(x, '행 n->', n)
    if n == N :  # 이게 같다는 건 마지막 까지 다 돌았다는 뜻
        result += 1
        print('***')
    else :
        for i in range(N):  # 0 부터 N-1까지
            print(is_free (i, n), '행 n:', n , ', 열 i:', i)
            if is_free (i, n):  # 처음 0, 0 던지면 True , 놓을 곳이 없으면 더 이상 안 내려감
                x[n] = i  # 인덱스가 행이고 값이 열(헷갈림)
                #print(x)
                dfs(n+1)

N = 3    # N*N 체스판에 퀸 N개를 놓는다
x = [0] * N
result = 0
dfs(0)
print('>', result)

'''
┌----┬----┐
│    │    │ 
├----┼----┤
│    │    │ 
└----┴----┘

[1, 3, 0, 2]
┌----┬----┬----┬----┐
│    │ <> │    │    │ 
├----┼----┼----┼----┤
│    │    │    │ <> │ 
├----┼----┼----┼----┤
│ <> │    │    │    │ 
├----┼----┼----┼----┤
│    │    │ <> │    │ 
└----┴----┴----┴----┘

[2, 0, 3, 1]
┌----┬----┬----┬----┐
│    │    │ <> │    │ 
├----┼----┼----┼----┤
│ <> │    │    │    │ 
├----┼----┼----┼----┤
│    │    │    │ <> │ 
├----┼----┼----┼----┤
│    │ <> │    │    │ 
└----┴----┴----┴----┘

'''