# 131
# for문의 실행결과를 예측하라.

# 과일 = ["사과", "귤", "수박"]
# for 변수 in 과일:
#     print(변수)

#  정답확인

# 132
# for문의 실행결과를 예측하라.

# 과일 = ["사과", "귤", "수박"]
# for 변수 in 과일:
#   print("#####")

#  정답확인
# 과일 = ["사과", "귤", "수박"] 에는 세 개의 데이터가 저장돼 있으므로 
# 들여쓰기된 print("####")코드가 세 번 실행됩니다.

# 133
# 다음 for 문과 동일한 기능을 수행하는 코드를 작성하세요.

# for 변수 in ["A", "B", "C"]:
#   print(변수)
#  정답확인

# 134
# for문을 풀어서 동일한 동작을하는 코드를 작성하라.

# for 변수 in ["A", "B", "C"]:
#   print("출력:", 변수)
#  정답확인

# 135
# for문을 풀어서 동일한 동작을 하는 코드를 작성하라.

# for 변수 in ["A", "B", "C"]:
#   b = 변수.lower()
#   print("변환:", b)
#  정답확인

# 136
# 다음 코드를 for문으로 작성하라.

# 변수 = 10
# print(변수)
# 변수 = 20
# print(변수)
# 변수 = 30
# print(변수)
#  정답확인
var = [10, 20, 30]
for v in var:
    print(v)

# 137
# 다음 코드를 for문으로 작성하라.

# print(10)
# print(20)
# print(30)
#  정답확인

# 138
# 다음 코드를 for문으로 작성하라.

# print(10)
# print("-------")
# print(20)
# print("-------")
# print(30)
# print("-------")
#  정답확인

# 139
# 다음 코드를 for문으로 작성하라.

# print("++++")
# print(10)
# print(20)
# print(30)
#  정답확인

# 140
# 다음 코드를 for문으로 작성하라.

# print("-------")
# print("-------")
# print("-------")
# print("-------")
#  정답확인

var = [1, 2, 3, 4]
for v in var:
    print("-------")
