
# 프로그래머스 스타일 로 ...
def solution(inp):
    answer = 'YES'
    # 각 행 1~9 중복없이 (검사)
    for i in range(len(inp)):
        #print(i)
        tmp = 0
        for j in range(len(inp)):
            tmp += inp[i][j]
        #print(1+2+3+4+5+6+7+8+9)
        if tmp != 45:
            #answer = 'N'
            #break
            return 'NO'

    # 이번엔 각 열 1~9 중복없이 (검사)
    for i in range(len(inp)):
        #print(i)
        tmp = 0
        for j in range(len(inp)):
            tmp += inp[j][i]
        #print(1+2+3+4+5+6+7+8+9)
        if tmp != 45:
            answer = 'NO'
            break
    print(answer)

    #00-22, 03-25, 06-28
    #30-52, 33-55, 36-58
    #60-82, 63-85, 66-88 이 순서로

    for i in range(0,len(inp), 3):
        for j in range(0,len(inp), 3):
            print(i, j, i+2, j+2)
            # 일단 여기서 루핑
            tmp2 =0
            for k in range(i, i+3):
                for l in range(j, j+3):
                    #print('>', k, l)
                    tmp2 += inp[k][l]
            #print('tmp2', tmp2)
            # ** 비교 위치를 잘 잡아야 함
            if tmp2 != 45:
                answer = 'NO'
                #print(k,j)
                break
    return answer

inp = [
[1,4,3,6,2,8,5,7,9],
[5,7,2,1,3,9,4,6,8],
[9,8,6,7,5,4,2,3,1],
[3,9,1,5,4,2,7,8,6],
[4,6,8,9,1,7,3,5,2],
[7,2,5,8,6,3,9,1,4],
[2,3,7,4,8,1,6,9,5],
[6,1,9,2,7,5,8,4,3],
[8,5,4,3,9,6,1,2,7]
]

re = solution(inp)
print('re :', re)
#=> YES
print('==============================')

inp = [
[1,2,3,4,5,6,7,8,9],
[2,1,4,3,6,5,8,9,7],
[3,4,1,2,7,8,9,5,6],
[4,3,2,1,8,9,6,7,5],
[5,6,7,8,9,1,2,3,4],
[6,5,8,9,1,7,3,4,2],
[7,8,9,5,2,3,4,6,1],
[8,9,6,7,4,2,5,1,3],
[9,7,5,6,3,4,1,2,8]
]

re = solution(inp)
print('re :', re)
#=> NO
print('==============================')

inp = [
[9,6,1,8,2,5,3,7,4],
[2,8,3,1,7,4,5,6,9],
[5,4,7,3,6,9,1,2,8],
[1,2,8,9,3,6,7,4,5],
[3,7,5,4,8,1,6,9,2],
[6,9,4,2,5,7,8,1,3],
[8,1,2,7,4,3,9,5,6],
[7,3,6,5,9,2,4,8,1],
[4,5,9,6,1,8,2,3,7]
]

re = solution(inp)
print('re :', re)
#=> YES
print('==============================')